import { Database } from '@nozbe/watermelondb'
import Deity from '../models/Deity'
import Stotra from '../models/Stotra'

export async function seedGanesha(database: Database) {
    const ganesha = await database.get<Deity>('deities').create(deity => {
            deity.name = 'గణేశుడు'
            deity.image = 'ganesha'
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'గణేశ పంచరత్నం'
            stotra.content = `ముదాకరాత్త మోదకం సదా విముక్తి సాధకం
కళాధరావతంసకం విలాసిలోక రక్షకమ్ |
అనాయకైక నాయకం వినాశితేభ దైత్యకం
నతాశుభాశు నాశకం నమామి తం వినాయకమ్ ||

నతేతరాతి భీకరం నవోదితార్క భాస్వరం
నమత్సురారి నిర్జరం నతాధికాపదుద్ధరమ్ |
సురేశ్వరం నిధీశ్వరం గజేశ్వరం గణేశ్వరం
మహేశ్వరం తమాశ్రయే పరాత్పరం నిరంతరమ్ ||

సమస్త లోక శంకరం నిరస్త దైత్య కుంజరం
దరేతరోదరం వరం వరేభవక్త్ర మక్షరమ్ |
కృపాకరం క్షమాకరం ముదాకరం యశస్కరం
మనస్కరం నమస్కృతాం నమస్కరోమి భాస్కరమ్ ||

అకించనార్తి మార్జనం చిరంతనోక్తి భాజనం
పురారి పూర్వ నందనం సురారి గర్వ చర్వణమ్ |
ప్రపంచ నాశ భీషణం ధనంజయాది భూషణం
కపోల దానవారణం భజే పురాణ వారణమ్ ||

నితాంత కాంత దంతకాంతి మంత కాంత కాత్మజం
అచింత్య రూపమంతహీన మంత్రమీశ మవ్యయమ్ |
హృదంతరే నిరంతరం వసంతమేవ యోగినాం
తమేకదంతమేవ తం వికల్ప మాశ్రయామహే ||`
            stotra.deity.set(ganesha)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'గణేశ అష్టోత్తర శతనామావళి'
            stotra.content = `ఓం గణాధిపాయ నమః |
ఓం ఉమాపుత్రాయ నమః |
ఓం అగ్నిగర్భచిదే నమః |
ఓం గజాననాయ నమః |
ఓం ద్వైమాతురాయ నమః |
ఓం గుణాత్మనే నమః |
ఓం కామినే నమః |
ఓం క్రోధహంత్రే నమః |
ఓం గణాధ్యక్షాయ నమః |
ఓం ఫాలనేత్రాయ నమః |
ఓం గజకర్ణకాయ నమః |
ఓం గౌరీసుతాయ నమః |
ఓం షడ్భుజాయ నమః |
ఓం గణేశ్వరాయ నమః |
ఓం గజాననాయ నమః |
ఓం ఏకదంతాయ నమః |
ఓం ఇదంప్రియాయ నమః |
ఓం సిద్ధిదాయకాయ నమః |
ఓం సిద్ధార్చితాయ నమః |
ఓం బీజపూరాయ నమః ||

ఇతి శ్రీ గణేశ అష్టోత్తర శతనామావళిః సంపూర్ణమ్ ||`
            stotra.deity.set(ganesha)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'శివ తాండవ స్తోత్రం'
            stotra.content = `వక్రతుండ మహాకాయ సూర్యకోటి సమప్రభ |
నిర్విఘ్నం కురు మే దేవ సర్వకార్యేషు సర్వదా ||

గజాననం భూత గణాది సేవితం
కపిత్థ జంబూ ఫల సార భక్షితమ్ |
ఉమాసుతం శోక వినాశ కారణం
నమామి విఘ్నేశ్వర పాద పంకజమ్ ||`
            stotra.deity.set(ganesha)
            stotra.isFavorite = false
        })
}
