import { Database } from '@nozbe/watermelondb'
import Deity from '../models/Deity'
import Stotra from '../models/Stotra'

export async function seedGanesha(database: Database) {
    const ganesha = await database.get<Deity>('deities').create(deity => {
        deity.name = 'గణేశుడు'
        deity.image = 'ganesha'
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'గణేశ పంచరత్నం'
        stotra.content = `ముదాకరాత్త మోదకం సదా విముక్తి సాధకం
కళాధరావతంసకం విలాసిలోక రక్షకమ్ |
అనాయకైక నాయకం వినాశితేభ దైత్యకం
నతాశుభాశు నాశకం నమామి తం వినాయకమ్ ||

నతేతరాతి భీకరం నవోదితార్క భాస్వరం
నమత్సురారి నిర్జరం నతాధికాపదుద్ధరమ్ |
సురేశ్వరం నిధీశ్వరం గజేశ్వరం గణేశ్వరం
మహేశ్వరం తమాశ్రయే పరాత్పరం నిరంతరమ్ ||

సమస్త లోక శంకరం నిరస్త దైత్య కుంజరం
దరేతరోదరం వరం వరేభవక్త్ర మక్షరమ్ |
కృపాకరం క్షమాకరం ముదాకరం యశస్కరం
మనస్కరం నమస్కృతాం నమస్కరోమి భాస్కరమ్ ||

అకించనార్తి మార్జనం చిరంతనోక్తి భాజనం
పురారి పూర్వ నందనం సురారి గర్వ చర్వణమ్ |
ప్రపంచ నాశ భీషణం ధనంజయాది భూషణం
కపోల దానవారణం భజే పురాణ వారణమ్ ||

నితాంత కాంత దంతకాంతి మంత కాంత కాత్మజం
అచింత్య రూపమంతహీన మంత్రమీశ మవ్యయమ్ |
హృదంతరే నిరంతరం వసంతమేవ యోగినాం
తమేకదంతమేవ తం వికల్ప మాశ్రయామహే ||`
        stotra.deity.set(ganesha)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'గణేశ అష్టోత్తర శతనామావళి'
        stotra.content = `ఓం గణాధిపాయ నమః |
ఓం ఉమాపుత్రాయ నమః |
ఓం అగ్నిగర్భచిదే నమః |
ఓం గజాననాయ నమః |
ఓం ద్వైమాతురాయ నమః |
ఓం గుణాత్మనే నమః |
ఓం కామినే నమః |
ఓం క్రోధహంత్రే నమః |
ఓం గణాధ్యక్షాయ నమః |
ఓం ఫాలనేత్రాయ నమః |
ఓం గజకర్ణకాయ నమః |
ఓం గౌరీసుతాయ నమః |
ఓం షడ్భుజాయ నమః |
ఓం గణేశ్వరాయ నమః |
ఓం గజాననాయ నమః |
ఓం ఏకదంతాయ నమః |
ఓం ఇదంప్రియాయ నమః |
ఓం సిద్ధిదాయకాయ నమః |
ఓం సిద్ధార్చితాయ నమః |
ఓం బీజపూరాయ నమః ||

ఇతి శ్రీ గణేశ అష్టోత్తర శతనామావళిః సంపూర్ణమ్ ||`
        stotra.deity.set(ganesha)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'శ్రీ గణేశ అష్టోత్తర శతనామావళి (108)'
        stotra.content = `ఓం గజాననాయ నమః
ఓం గణాధ్యక్షాయ నమః
ఓం విఘ్నారాజాయ నమః
ఓం వినాయకాయ నమః
ఓం ద్త్వెమాతురాయ నమః
ఓం ద్విముఖాయ నమః
ఓం ప్రముఖాయ నమః
ఓం సుముఖాయ నమః
ఓం కృతినే నమః
ఓం సుప్రదీపాయ నమః

ఓం సుఖనిధయే నమః
ఓం సురాధ్యక్షాయ నమః
ఓం సురారిఘ్నాయ నమః
ఓం మహాగణపతయే నమః
ఓం మాన్యాయ నమః
ఓం మహాకాలాయ నమః
ఓం మహాబలాయ నమః
ఓం హేరంబాయ నమః
ఓం లంబజఠరాయ నమః
ఓం హ్రస్వగ్రీవాయ నమః

ఓం మహోదరాయ నమః
ఓం మదోత్కటాయ నమః
ఓం మహావీరాయ నమః
ఓం మంత్రిణే నమః
ఓం మంగళస్వరాయ నమః
ఓం ప్రమథాయ నమః
ఓం ప్రథమాయ నమః
ఓం ప్రాజ్ఞాయ నమః
ఓం విఘ్నకర్త్రే నమః
ఓం విఘ్నహంత్రే నమః

ఓం విశ్వనేత్రే నమః
ఓం విరాట్పతయే నమః
ఓం శ్రీపతయే నమః
ఓం వాక్పతయే నమః
ఓం శృంగారిణే నమః
ఓం ఆశ్రితవత్సలాయ నమః
ఓం శివప్రియాయ నమః
ఓం శీఘ్రకారిణే నమః
ఓం శాశ్వతాయ నమః
ఓం బలాయ నమః

ఓం బలోత్థితాయ నమః
ఓం భవాత్మజాయ నమః
ఓం పురాణ పురుషాయ నమః
ఓం పూష్ణే నమః
ఓం పుష్కరోత్ప్త వారిణే నమః
ఓం అగ్రగణ్యాయ నమః
ఓం అగ్రపూజ్యాయ నమః
ఓం అగ్రగామినే నమః
ఓం మంత్రకృతే నమః
ఓం చామీకరప్రభాయ నమః

ఓం సర్వాయ నమః
ఓం సర్వోపాస్యాయ నమః
ఓం సర్వకర్త్రే నమః
ఓం సర్వనేత్రే నమః
ఓం సర్వసిద్ధీప్రదాయ నమః
ఓం సర్వసిద్ధయే నమః
ఓం పంచహస్తాయ నమః
ఓం పార్వతీనందనాయ నమః
ఓం ప్రభవే నమః
ఓం కుమార గురవే నమః

ఓం అక్షోభ్యాయ నమః
ఓం కుంజరాసురభంజనాయ నమః
ఓం ప్రమోదాయ నమః
ఓం మోదకప్రియాయ నమః
ఓం కాంతిమతే నమః
ఓం ధృతిమతే నమః
ఓం కామినే నమః
ఓం కపిత్థవనప్రియాయ నమః
ఓం బ్రహ్మచారిణే నమః
ఓం బ్రహ్మరూపిణే నమః

ఓం బ్రహ్మవిద్యాది దానభువే నమః
ఓం జిష్ణవే నమః
ఓం విష్ణుప్రియాయ నమః
ఓం భక్తజీవితాయ నమః
ఓం జితమన్మథాయ నమః
ఓం ఐశ్వర్యకారణాయ నమః
ఓం జ్యాయసే నమః
ఓం యక్షకిన్నెర సేవితాయ నమః
ఓం గంగాసుతాయ నమః
ఓం గణాధీశాయ నమః

ఓం గంభీరనినాదాయ నమః
ఓం వటవే నమః
ఓం అభీష్టవరదాయినే నమః
ఓం జ్యోతిషే నమః
ఓం భక్తనిధయే నమః
ఓం భావగమ్యాయ నమః
ఓం మంగళప్రదాయ నమః
ఓం అవ్యక్తాయ నమః
ఓం అప్రాకృత పరాక్రమాయ నమః
ఓం సత్యధర్మిణే నమః

ఓం సఖాయే నమః
ఓం సరసాంబునిధయే నమః
ఓం మహేశాయ నమః
ఓం దివ్యాంగాయ నమః
ఓం మణికింకిణీమేఖాలాయ నమః
ఓం సమస్తదేవతామూర్తయే నమః
ఓం సహిష్ణవే నమః
ఓం సతతోత్థితాయ నమః
ఓం విఘాతకారుణే నమః
ఓం విశ్వగ్దృషే నమః

ఓం విశ్వరక్షాకృతే నమః
ఓం కళ్యాణగురవే నమః
ఓం ఉన్మత్తవేషాయ నమః
ఓం అపరాజితే నమః
ఓం సమస్తజగదాధారాయ నమః
ఓం సర్వేశ్వర్యప్రదాయ నమః
ఓం ఆక్రాంతచిదచిత్ ప్రభవే నమః
ఓం శ్రీ విజ్ఞేశ్వరాయ / శ్రీ విఘ్నేశ్వరాయ నమః`
        stotra.deity.set(ganesha)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'గణేశ సహస్ర నామావళి (1000)'
        stotra.content = `ఓం గణేశ్వరాయ నమః |
ఓం గణక్రీడాయ నమః |
ఓం గణనాథాయ నమః |
ఓం గణాధిపాయ నమః |
ఓం ఏకదంష్ట్రాయ నమః |
ఓం వక్రతుందాయ నమః |
ఓం గజవక్త్రాయ నమః |
ఓం మహోదరాయ నమః |
ఓం లంబోదరాయ నమః |
ఓం ధూమ్రవర్ణాయ నమః |
ఓం వికటాయ నమః |
ఓం విఘ్ననాయకాయ నమః |
ఓం సుముఖాయ నమః |
ఓం దుర్ముఖాయ నమః |
ఓం బుద్ధాయ నమః |
ఓం విఘ్నరాజాయ నమః |
ఓం గజాననాయ నమః |
ఓం భీమాయ నమః |
ఓం ప్రమోదాయ నమః |
ఓం ఆమోదాయ నమః |
ఓం సురానందాయ నమః |
ఓం మదోత్కటాయ నమః |
ఓం హేరంబాయ నమః |
ఓం శంబరాయ నమః |
ఓం శంభవే నమః |
ఓం లంబకర్ణాయ నమః |
ఓం మహాబలాయ నమః |
ఓం నందనాయ నమః |
ఓం అలంపటాయ నమః |
ఓం అభీరవే నమః |
ఓం మేఘనాదాయ నమః |
ఓం గణంజయాయ నమః |
ఓం వినాయకాయ నమః |
ఓం విరూపాక్షాయ నమః |
ఓం ధీరశూరాయ నమః |
ఓం వరప్రదాయ నమః |
ఓం మహాగణపతయే నమః |
ఓం బుద్ధిప్రియాయ నమః |
ఓం క్షిప్రప్రసాదనాయ నమః |
ఓం రుద్రప్రియాయ నమః |
ఓం గణాధ్యక్షాయ నమః |
ఓం ఉమాపుత్రాయ నమః |
ఓం అఘనాశనాయ నమః |
ఓం కుమారగురవే నమః |
ఓం ఈశానపుత్రాయ నమః |
ఓం మూషకవాహనాయ నమః |
ఓం సిద్ధిప్రియాయ నమః |
ఓం సిద్ధిపతయే నమః |
ఓం సిద్ధాయ నమః |
ఓం సిద్ధివినాయకాయ నమః |
ఓం అవిఘ్నాయ నమః |
ఓం తుంబురవే నమః |
ఓం సింహవాహనాయ నమః |
ఓం మోహినీప్రియాయ నమః |
ఓం కటంకటాయ నమః |
ఓం రాజపుత్రాయ నమః |
ఓం శాలకాయ నమః |
ఓం సమ్మితాయ నమః |
ఓం అమితాయ నమః |
ఓం కూష్మాండసామసంభూతయే నమః |
ఓం దుర్జయాయ నమః |
ఓం ధూర్జయాయ నమః |
ఓం జయాయ నమః |
ఓం భూపతయే నమః |
ఓం భువనపతయే నమః |
ఓం భూతానాం పతయే నమః |
ఓం అవ్యయాయ నమః |
ఓం విశ్వకర్త్రే నమః |
ఓం విశ్వముఖాయ నమః |
ఓం విశ్వరూపాయ నమః |
ఓం నిధయే నమః |
ఓం ఘృణయే నమః |
ఓం కవయే నమః |
ఓం కవీనామృషభాయ నమః |
ఓం బ్రహ్మణ్యాయ నమః |
ఓం బ్రహ్మణస్పతయే నమః |
ఓం జ్యేష్ఠరాజాయ నమః |
ఓం నిధిపతయే నమః |
ఓం నిధిప్రియపతిప్రియాయ నమః |
ఓం హిరణ్మయపురాంతఃస్థాయ నమః |
ఓం అష్టైశ్వర్యప్రదాయకాయ నమః |
ఓం అష్టపీఠోపపీఠశ్రియే నమః |
ఓం అష్టమాతృసమావృతాయ నమః |
ఓం అష్టభైరవసేవ్యాయ నమః |
ఓం అష్టవసువంద్యాయ నమః |
ఓం అష్టమూర్తిభృతే నమః |
ఓం అష్టచక్రస్ఫురన్మూర్తయే నమః |
ఓం అష్టద్రవ్యహవిఃప్రియాయ నమః |
ఓం నవనాగాసనాధ్యాసినే నమః |
ఓం నవనిథ్యనుశాసితాయ నమః |
ఓం నవద్వారపురాధారాయ నమః |
ఓం పంచాశదక్షరశ్రేణయే నమః |
ఓం పంచాక్షరమధ్యస్థాయ నమః |
ఓం పంచబ్రహ్మస్వరూపిణే నమః |
ఓం పంచప్రాణాధారాయ నమః |
ఓం పంచభూతాత్మకాయ నమః |
ఓం పంచార్థకృతయే నమః |
ఓం పంచతత్త్వరూపాయ నమః |
ఓం పంచయజ్ఞప్రియాయ నమః |
ఓం పంచాయుధభృతే నమః |
ఓం పంచామృతభోజినే నమః |
ఓం పంచగవ్యప్రియాయ నమః |
ఓం పంచపరార్ధదాయకాయ నమః |
ఓం పంచగవ్యస్నాపకాయ నమః |
ఓం పంచరత్నాత్మకాయ నమః |
ఓం పంచాననాయ నమః |
ఓం పంచవేద విదే నమః |
ఓం పంచకల్పకర్త్రే నమః |
ఓం పంచకోశవిభేదినే నమః |
ఓం పంచదర్పదమయే నమః |
ఓం నవరత్నోపశోభితాయ నమః |
ఓం నవరసప్రదాయ నమః |
ఓం నవరూపధారిణే నమః |
ఓం నవరత్నమయప్రభాయె నమః |
ఓం నవరత్నవిభూషితాయ నమః |
ఓం నవరత్నవిభూతయే నమః |
ఓం నవధాన్యాధిపాయ నమః |
ఓం నవనాథస్వరూపిణే నమః |
ఓం నవనారాయణాయ నమః |
ఓం నవరూపప్రదాయ నమః |
ఓం నవరసప్రియాయ నమః |
ఓం నవనీతసమానాయ నమః |
ఓం నవరత్నవిభూషితాయ నమః |
ఓం నవపదరత్నధారిణే నమః |
ఓం నవవర్ణస్వరూపిణే నమః |
ఓం నవగ్రహపతయే నమః |
ఓం నవదేవతాత్మకాయ నమః |
ఓం నవనాథప్రపూజ్యాయ నమః |
ఓం నవనాగాసనారూఢాయ నమః |
ఓం నవనాగాపహారిణే నమః |
ఓం నవయోగినీగుప్తాయ నమః |
ఓం నవమున్యుపచారిణే నమః |
ఓం శతరూపప్రదాయ నమః |
ఓం శతరూపవిభేదినే నమః |
ఓం శతకోటి ప్రపూజితాయ నమః |
ఓం శతకోటి భక్తహృదయాయ నమః |
ఓం శతకోటి మహేశ్వరాయ నమః |
ఓం శతకోటి గణాస్వరూపిణే నమః |
ఓం శతకోటిగణాధిపాయ నమః |
ఓం శతకోటి మహాభైరవసేవ్యాయ నమః |
ఓం శతకోటి మంత్రరాజాయ నమః |
ఓం శతకోటి విఘ్నహర్త్రే నమః |
ఓం శతకోటి బలిప్రియాయ నమః |
ఓం శతకోటి కరాధ్యాయ నమః |
ఓం శతకోటి పతాకాధరాయ నమః |
ఓం శతకోటి నయనాయ నమః |
ఓం శతకోటి భూషణాయ నమః |
ఓం శతకోటి రూపధారిణే నమః |
ఓం శతకోటి గంధప్రియాయ నమః |
ఓం శతకోటి రాగప్రియాయ నమః |
ఓం శతకోటి రసభుజే నమః |
ఓం శతకోటి లీలాకృతే నమః |
ఓం శతకోటి సుఖప్రదాయ నమః |
ఓం శతకోటి సుఖస్వరూపిణే నమః |
ఓం శతకోటి సిద్ధివినాయకాయ నమః |
ఓం శతకోటి హరిద్రప్రియాయ నమః |
ఓం శతకోటి మహాబలాయ నమః |
ఓం శతకోటి సమృద్ధిపతయే నమః |
ఓం శతకోటి సంపదప్రదాయ నమః |
ఓం శతకోటి సంపద్విభూషితాయ నమః |
ఓం శతకోటి వసుధాధిపాయ నమః |
ఓం శతకోటి మహాగణపతయే నమః |
ఓం శతకోటి యజ్ఞరూపిణే నమః |
ఓం శతకోటి యజ్ఞదాయ నమః |
ఓం శతకోటి విఘ్నరాజాయ నమః |
ఓం శతకోటి పరిపాలకాయ నమః |
ఓం శతకోటి మహేశాయ నమః |
ఓం శతకోటి గజాననాయ నమః |
ఓం శతకోటి గజపతయే నమః |
ఓం శతకోటి గజరూపిణే నమః |
ఓం శతకోటి గజకర్ణాయ నమః |
ఓం శతకోటి గజవక్త్రాయ నమః |
ఓం శతకోటి గజవిక్రమాయ నమః |
ఓం శతకోటి మహోదరాయ నమః |
ఓం శతకోటి లంబోదరాయ నమః |
ఓం శతకోటి గణాధిపాయ నమః |
ఓం శతకోటి గణనాయకాయ నమః |
ఓం శతకోటి భక్తవత్సలాయ నమః |
ఓం శతకోటి భక్తపాలకాయ నమః |
ఓం శతకోటి భక్తార్తిహరాయ నమః |
ఓం శతకోటి భక్తసంరక్షకాయ నమః |
ఓం శతకోటి దయాసాగరాయ నమః |
ఓం శతకోటి కరుణానిధయే నమః |
ఓం శతకోటి కరుణాకరాయ నమః |
ఓం శతకోటి ఆశ్రితవత్సలాయ నమః |
ఓం శతకోటి దయామయాయ నమః |
ఓం శతకోటి పాపహరాయ నమః |
ఓం శతకోటి పాపనాశనాయ నమః |
ఓం శతకోటి పాపవిమోచనాయ నమః |
ఓం శతకోటి దుఃఖహరాయ నమః |
ఓం శతకోటి దుఃఖనివారణాయ నమః |
ఓం శతకోటి దురితనాశనాయ నమః |
ఓం శతకోటి దుర్గతినాశనాయ నమః |
ఓం శతకోటి దుష్టదమకాయ నమః |
ఓం శతకోటి దుష్టహరాయ నమః |
ఓం శతకోటి దుష్టశమనాయ నమః |
ఓం శతకోటి దుష్టసంహారిణే నమః |
ఓం శతకోటి మహాప్రభవే నమః |
ఓం శతకోటి మహాధనాయ నమః |
ఓం శతకోటి మహావిభూతయే నమః |
ఓం శతకోటి మహాశక్తయే నమః |
ఓం శతకోటి మహాప్రభాయే నమః |
ఓం శతకోటి మహామతయే నమః |
ఓం శతకోటి మహామహిమ్నే నమః |
ఓం శతకోటి మహాబలాయ నమః |
ఓం శతకోటి మహోన్నతాయ నమః |
ఓం శతకోటి మహాదేవాయ నమః |
ఓం శతకోటి మహాగణపతయే నమః |
ఓం శతకోటి మహాయషసే నమః |
ఓం శతకోటి మహాతేజసే నమః |
ఓం శతకోటి మహోత్కటాయ నమః |
ఓం శతకోటి మహోద్ధతాయ నమః |
ఓం శతకోటి మహావిరాయ నమః |
ఓం శతకోటి మహాశూరాయ నమః |
ఓం శతకోటి మహాబలాయ నమః |
ఓం శతకోటి మహాశాంతాయ నమః |
ఓం శతకోటి మహాదేవాయ నమః |
ఓం శతకోటి మహాగణపతయే నమః |
ఓం శతకోటి మహాధీపాయ నమః |
ఓం శతకోటి మహామేధసే నమః |
ఓం శతకోటి మహాయశసే నమః |
ఓం శతకోటి మహోత్కర్షాయ నమః |
ఓం శతకోటి మహాప్రజ్ఞాయ నమః |
ఓం శతకోటి మహాముఖాయ నమః |
ఓం శతకోటి మహాహాసాయ నమః |
ఓం శతకోటి మహాశ్రేయసే నమః |
ఓం శతకోటి మహామంగళాయ నమః |
ఓం శతకోటి మహాసంపదే నమః |
ఓం శతకోటి మహాభోగాయ నమః |
ఓం శతకోటి మహాశ్రీమతే నమః |
ఓం శతకోటి మహాభాగ్యాయ నమః |
ఓం శతకోటి మహాదేవాయ నమః |
ఓం శతకోటి మహామూర్తయే నమః |
ఓం శతకోటి మహాభాగాయ నమః |
ఓం శతకోటి మహాచ్ఛత్రాయ నమః |
ఓం శతకోటి మహాధ్వజాయ నమః |
ఓం శతకోటి మహామేఖలాయ నమః |
ఓం శతకోటి మహారత్నాయ నమః |
ఓం శతకోటి మహాభూషణాయ నమః |
ఓం శతకోటి మహామాలాయ నమః |
ఓం శతకోటి మహామాణిక్యాయ నమః |
ఓం శతకోటి మహాభస్మనాధాయ నమః |
ఓం శతకోటి మహాసిద్ధయే నమః |
ఓం శతకోటి మహామంత్రాయ నమః |
ఓం శతకోటి మహాయంత్రాయ నమః |
ఓం శతకోటి మహాతంత్రాయ నమః |
ఓం శతకోటి మహాయోగినే నమః |
ఓం శతకోటి మహాఋషయే నమః |
ఓం శతకోటి మహాతపసే నమః |
ఓం శతకోటి మహాగుహాయ నమః |
ఓం శతకోటి మహాగర్భాయ నమః |
ఓం శతకోటి మహాసామర్థ్యాయ నమః |
ఓం శతకోటి మహావిజయాయ నమః |
ఓం శతకోటి మహాబీజాయ నమః |
ఓం శతకోటి మహాశక్తయే నమః |
ఓం శతకోటి మహాప్రభావాయ నమః |
ఓం శతకోటి మహాశౌర్యాయ నమః |
ఓం శతకోటి మహాధనాయ నమః |
ఓం శతకోటి మహాధాత్రే నమః |
ఓం శతకోటి మహాకర్త్రే నమః |
ఓం శతకోటి మహాహర్త్రే నమః |
ఓం శతకోటి మహాధర్త్రే నమః |
ఓం శతకోటి మహాసేత్రే నమః |
ఓం శతకోటి మహాభూతయే నమః |
ఓం శతకోటి మహాసాక్షిణే నమః |
ఓం శతకోటి మహాచిద్రూపాయ నమః |
ఓం శతకోటి మహాయోగాయ నమః |
ఓం శతకోటి మహాజ్ఞానాయ నమః |
ఓం శతకోటి మహావిజ్ఞాయ నమః |
ఓం శతకోటి మహామహిమాన్వితాయ నమః |
ఓం శతకోటి మహాగురు పూజ్యాయ నమః |
ఓం శతకోటి మహాజ్యోతిషే నమః |
ఓం శతకోటి మహాదర్పాయ నమః |
ఓం శతకోటి మహోదారాయ నమః |
ఓం శతకోటి మహోన్నతదేహాయ నమః |
ఓం శతకోటి మహాగర్వితాయ నమః |
ఓం శతకోటి మహామహాత్మనే నమః |
ఓం శతకోటి మహాభగవతే నమః |
ఓం శతకోటి మహాగ్రామిణే నమః |
ఓం శతకోటి మహాసంవత్సరాయ నమః |
ఓం శతకోటి మహాకాలాయ నమః |
ఓం శతకోటి మహాకాశాయ నమః |
ఓం శతకోటి మహాక్రమాయ నమః |
ఓం శతకోటి మహాధారాయ నమః |
ఓం శతకోటి మహావ్యూహాయ నమః |
ఓం శతకోటి మహాసంఘాయ నమః |
ఓం శతకోటి మహాగీతాయ నమః |
ఓం శతకోటి మహామహిమాయ నమః |
ఓం శతకోటి మహాసరణాయ నమః |
ఓం శతకోటి మహాపరాక్రమాయ నమః |
ఓం శతకోటి పరబ్రహ్మణే నమః |
ఓం శతకోటి పరమాత్మనే నమః |
ఓం శతకోటి పరతత్త్వాయ నమః |
ఓం శతకోటి పరాకాష్ఠాయ నమః |
ఓం శతకోటి పరిణిష్ఠితాయ నమః |
ఓం శతకోటి పరబీజాయ నమః |
ఓం శతకోటి పరమయోగినే నమః |
ఓం శతకోటి పరమేశ్వరాయ నమః |
ఓం శతకోటి పరమాదేవాయ నమః |
ఓం శతకోటి పరమానందాయ నమః |
ఓం శతకోటి పరానుగ్రహకారిణే నమః |
ఓం శతకోటి పరమపుష్కలాయ నమః |
ఓం శతకోటి పరాక్రమశాలినే నమః |
ఓం శతకోటి పరమౌజసే నమః |
ఓం శతకోటి పరమశాంతాయ నమః |
ఓం శతకోటి పరమమంగళాయ నమః |
ఓం శతకోటి పరమపవిత్రాయ నమః |
ఓం శతకోటి పరమసిద్ధయే నమః |
ఓం శతకోటి పరమపావనాయ నమః |
ఓం శతకోటి పరమయోగాధిపాయ నమః |
ఓం శతకోటి పరమమోక్షదాయ నమః |
ఓం శతకోటి పరమశుభకారిణే నమః |
ఓం శతకోటి పరమవిఘ్నహర్త్రే నమః |
ఓం శతకోటి పరమసంపదాదాయకాయ నమః |
ఓం శతకోటి పరమదివ్యాయ నమః |
ఓం శతకోటి పరమధ్యుతినామ్నే నమః |
ఓం శతకోటి పరమపతయే నమః |
ఓం శతకోటి పరమేశితృప్రదాయ నమః |
ఓం శతకోటి పరమేశ్వరసేవ్యాయ నమః |
ఓం శతకోటి పరమశక్తిమతే నమః |
ఓం శతకోటి పరమధర్మిణే నమః |
ఓం శతకోటి పరమయోగినే నమః |
ఓం శతకోటి పరమశుభాయ నమః |
ఓం శతకోటి పరమదయామయాయ నమః |
ఓం శతకోటి పరమభక్తప్రియాయ నమః |
ఓం శతకోటి పరమనాయకాయ నమః |
ఓం శతకోటి పరమేశ్వరాయ నమః |
ఓం శతకోటి పరమప్రభాయే నమః |
ఓం శతకోటి పరమసూర్యాయ నమః |
ఓం శతకోటి పరమచంద్రాయ నమః |
ఓం శతకోటి పరమనక్షత్రాయ నమః |
ఓం శతకోటి పరమాగ్నయే నమః |
ఓం శతకోటి పరమనాదాయ నమః |
ఓం శతకోటి పరమవాయవే నమః |
ఓం శతకోటి పరమాంబసే నమః |
ఓం శతకోటి పరమాకాశాయ నమః |
ఓం శతకోటి పరమభూథాయ నమః |
ఓం శతకోటి పరమానందమూర్తయే నమః |
ఓం శతకోటి పరమచైతన్యాయ నమః |
ఓం శతకోటి పరమచిద్రూపిణే నమః |
ఓం శతకోటి పరమఘనానందాయ నమః |
ఓం శతకోటి పరమప్రశాంతాయ నమః |
ఓం శతకోటి పరమశరణ్యాయ నమః |
ఓం శతకోటి పరమాధారాయ నమః |
ఓం శతకోటి పరమప్రభవే నమః |
ఓం శతకోటి పరమజ్యోతిషే నమః |
ఓం శతకోటి పరమతేజసే నమః |
ఓం శతకోటి పరమవిగ్రహాయ నమః |
ఓం శతకోటి పరమోద్భవాయ నమః |
ఓం శతకోటి పరమోత్కృష్టాయ నమః |
ఓం శతకోటి పరమసుశీలాయ నమః |
ఓం శతకోటి పరమసౌమ్యాయ నమః |
ఓం శతకోటి పరమదక్షిణాయ నమః |
ఓం శతకోటి పరమశాంతిప్రదాయ నమః |
ఓం శతకోటి పరమకరుణాకరాయ నమః |
ఓం శతకోటి పరమార్తిహరాయ నమః |
ఓం శతకోటి పరమయోగవిదే నమః |
ఓం శతకోటి పరమయోగపతయే నమః |
ఓం శతకోటి పరమయోగేంద్రాయ నమః |
ఓం శతకోటి పరమయోగసిద్ధయే నమః |
ఓం శతకోటి పరమసిద్ధయే నమః |
ఓం శతకోటి పరమసిద్ధేశ్వరాయ నమః |
ఓం శతకోటి పరంబీజాయ నమః |
ఓం శతకోటి పరమశక్తయే నమః |
ఓం శతకోటి పరమాత్మరూపిణే నమః |
ఓం శతకోటి పరమేశాధిపాయ నమః |
ఓం శతకోటి పరమస్తితయే నమః |
ఓం శతకోటి పరమకృపానిధయే నమః |
ఓం శతకోటి పరమతులసాయ నమః |
ఓం శతకోటి పరమచరిత్రాయ నమః |
ఓం శతకోటి పరమలీలాయ నమః |
ఓం శతకోటి పరమదయా రూపాయ నమః |
ఓం శతకోటి పరమజగన్నాయకాయ నమః |
ఓం శతకోటి పరమవిఘ్నవారిణే నమః |
ఓం శతకోటి పరమసిద్ధిఫలప్రదాయ నమః |
ఓం శతకోటి పరమయోగకారిణే నమః |
ఓం శతకోటి పరమదేవాయ నమః |
ఓం శతకోటి పరమదేవరూపిణే నమః |
ఓం శతకోటి పరమశుభాయ నమః |
ఓం శతకోటి పరమశుభకారిణే నమః |
ఓం శతకోటి పరమవర్మిణే నమః |
ఓం శతకోటి పరివర్మిణే నమః |
ఓం శతకోటి పరమావరణాయ నమః |
ఓం శతకోటి పరమభూతయే నమః |
ఓం శతకోటి పరమాధారమూర్తయే నమః |
ఓం శతకోటి పరమదీపాయ నమః |
ఓం శతకోటి పరమార్కాయ నమః |
ఓం శతకోటి పరమాగ్నయే నమః |
ఓం శతకోటి పరమచంద్రాయ నమః |
ఓం శతకోటి పరమనక్షత్రమయాయ నమః |
ఓం శతకోటి పరమానిలాయ నమః |
ఓం శతకోటి పరమాంబసే నమః |
ఓం శతకోటి పరమాకాశరూపాయ నమః |
ఓం శతకోటి పరాంశురూపిణే నమః |
ఓం శతకోటి పరమభౌమాయ నమః |
ఓం శతకోటి పరమనీలా నీలమేఘాయ నమః |
ఓం శతకోటి పరమాదిత్యాయ నమః |
ఓం శతకోటి పరమసోమాయ నమః |
ఓం శతకోటి పరమాగ్నిమయాయ నమః |
ఓం శతకోటి పరమరుద్రమయాయ నమః |
ఓం శతకోటి పరమవిష్ణురూపిణే నమః |
ఓం శతకోటి పరంబ్రహ్మణే నమః |
ఓం శతకోటి పరమేశ్వరాయ నమః |
ఓం శతకోటి పరమశంభవే నమః |
ఓం శతకోటి పరమనారాయణాయ నమః |
ఓం శతకోటి పరమహంసరూపిణే నమః |
ఓం శతకోటి పరమయోగదాయ నమః |
ఓం శతకోటి పరమాంధకరిప్రహారిణే నమః |
ఓం శతకోటి పరంజ్యోతిషే నమః |
ఓం శతకోటి పరమసూర్యకాంతాయ నమః |
ఓం శతకోటి పరమమంగళాయ నమః |
ఓం శతకోటి పరమకరుణామయాయ నమః |
ఓం శతకోటి పరమవత్సలాయ నమః |
ఓం శతకోటి పరమహృదయేశ్వరాయ నమః |
ఓం శతకోటి పరమపాలకాయ నమః |
ఓం శతకోటి పరమాదాయ నమః |
ఓం శతకోటి పరమోపకారిణే నమః |
ఓం శతకోటి పరమోద్భవాయ నమః |
ఓం శతకోటి పరమవైదికాయ నమః |
ఓం శతకోటి పరమాగమప్రియాయ నమః |
ఓం శతకోటి పరమపుణ్యమూర్తయే నమః |
ఓం శతకోటి పరమసత్యరూపిణే నమః |
ఓం శతకోటి పరమవేదవచసే నమః |
ఓం శతకోటి పరమానందప్రదాయ నమః |
ఓం శతకోటి పరమాయుధాయ నమః |
ఓం శతకోటి పరమస్తోత్రమయాయ నమః |
ఓం శతకోటి పరమపఠితప్రదాయ నమః |
ఓం శతకోటి పరమోగ్రాయ నమః |
ఓం శతకోటి పరమఘోరాయ నమః |
ఓం శతకోటి పరమశాంతాయ నమః |
ఓం శతకోటి పరమాభీష్టప్రదాయ నమః |
ఓం శతకోటి పరమార్తిహరాయ నమః |
ఓం శతకోటి పరమసిద్ధాయ నమః |
ఓం శతకోటి పరమనందకందాయ నమః |
ఓం శతకోటి పరమనిగుడాయ నమః |
ఓం శతకోటి పరమధ్యానసమాధినే నమః |
ఓం శతకోటి పరమైకరసప్రదాయ నమః |
ఓం శతకోటి పరమశ్రీపతయే నమః |
ఓం శతకోటి పరమయోగేశ్వరాయ నమః |
ఓం శతకోటి పరమయోగసిద్ధిధరాయ నమః |
ఓం శతకోటి పరమయోగసౌఖ్యప్రదాయ నమః |
ఓం శతకోటి పరమానందరూపిణే నమః |
ఓం శతకోటి పరమానందవిభావనాయ నమః |
ఓం శతకోటి పరమకల్యాణాయ నమః |
ఓం శతకోటి పరమభవబంధమోచనాయ నమః |
ఓం శతకోటి పరమమోక్షప్రదాయ నమః |
ఓం శతకోటి పరమప్రేమమూర్తయే నమః |
ఓం శతకోటి పరమవత్సలాయ నమః |
ఓం శతకోటి పరమభక్తావాసాయ నమః |
ఓం శతకోటి పరమభక్తసేవ్యాయ నమః |
ఓం శతకోటి పరమభక్తపరిపాలనాయ నమః |
ఓం శతకోటి పరమభక్తమానసచారిణే నమః |
ఓం శతకోటి పరమసత్కారిణే నమః |
ఓం శతకోటి పరమవిద్వత్తమాయ నమః |
ఓం శతకోటి పరమశాస్త్రరూపిణే నమః |
ఓం శతకోటి పరమవేదరసస్వరూపిణే నమః |
ఓం శతకోటి పరమోక్తిదాయ నమః |
ఓం శతకోటి పరమవాక్పతయే నమః |
ఓం శతకోటి పరమబ్రహ్మవిదే నమః |
ఓం శతకోటి పరమవేదాంతవిదే నమః |
ఓం శతకోటి పరమోపనిషద్రూపిణే నమః |
ఓం శతకోటి పరమసత్యమూర్తయే నమః |
ఓం శతకోటి పరమవిభూతిదాయ నమః |
ఓం శతకోటి పరమాధ్యాత్మరూపాయ నమః |
ఓం శతకోటి పరమశుద్ధాయ నమః |
ఓం శతకోటి పరమానందవిస్తారాయ నమః |
ఓం శతకోటి పరమజ్ఞానమూర్తయే నమః |
ఓం శతకోటి పరమచిదాత్మనே నమః |
ఓం శతకోటి పరమానందపూర్ణాయ నమః |
ఓం శతకోటి పరమవిద్యాస్వరూపిణే నమః |
ఓం శతకోటి పరమోపకారిణే నమః |
ఓం శతకోటి పరమానందవిభూతయే నమః |
ఓం శతకోటి పరమపండితాయ నమః |
ఓం శతకోటి పరమమాతంగాయ నమః |
ఓం శతకోటి పరమవిపులాయ నమః |
ఓం శతకోటి పరమభద్రాయ నమః |
ఓం శతకోటి పరమభవభంజనాయ నమః |
ఓం శతకోటి పరమజగన్నాయకాయ నమః |
ఓం శతకోటి పరమపరమేశ్వరాయ నమః |
ఓం శతకోటి పరమపరశక్తయే నమః |
ఓం శతకోటి పరమప్రభవాంబుధయే నమః |
ఓం శతకోటి పరమబీజాయ నమః |
ఓం శతకోటి పరమమంత్రరూపిణే నమః |
ఓం శతకోటి పరమయంత్రప్రదాయ నమః |
ఓం శతకోటి పరమతంత్రవిదే నమః |
ఓం శతకోటి పరమరక్షాధిపాయ నమః |
ఓం శతకోటి పరమదేవేశ్వరాయ నమః |
ఓం శతకోటి పరమయోగరాజాయ నమః |
ఓం శతకోటి పరమయోగినాంపతయే నమః |
ఓం శతకోటి పరంమోక్షప్రదాయ నమః |
ఓం శతకోటి పరంసౌఖ్యప్రదాయ నమః |
ఓం శతకోటి పరంశాంతిదాయ నమః |
ఓం శతకోటి పరమతేజసే నమః |
ఓం శతకోటి పరమవిశాలాయ నమః |
ఓం శతకోటి పరమోన్నతశిరసే నమః |
ఓం శతకోటి పరమవివేకదాత్రే నమః |
ఓం శతకోటి పరమధర్మరక్షకాయ నమః |
ఓం శతకోటి పరమారాధ్యాయ నమః |
ఓం శతకోటి పరమజగద్గురవే నమః |
ఓం శతకోటి పరమసంవిధే నమః |
ఓం శతకోటి పరమహృదయావాసాయ నమః |
ఓం శతకోటి పరమమాయామయాయ నమః |
ఓం శతకోటి పరమవిద్యాధరాయ నమః |
ఓం శతకోటి పరమయోగసిద్ధప్రదాయ నమః |
ఓం శతకోటి పరమవిశుద్ధాయ నమః |
ఓం శతకోటి పరమసర్వేశ్వరాయ నమః |
ఓం శతకోటి పరమాధిపతయే నమః |
ఓం శతకోటి పరమైకాంతభక్తప్రియాయ నమః |
ఓం శతకోటి పరమపరమానందాయ నమః |
ఓం శతకోటి పరమజగద్భరాయ నమః |
ఓం శతకోటి పరమసిద్ధిదాయ నమః |
ఓం శతకోటి పరమశక్తిసముద్రాయ నమః |
ఓం శతకోటి పరమసింహవాహనాయ నమః |
ఓం శతకోటి పరమసర్వసిద్ధిప్రదాయ నమః |
ఓం శతకోటి పరమవిద్యాధిపాయ నమః |
ఓం శతకోటి పరమసత్యవాగ్మయాయ నమః |
ఓం శతకోటి పరమమంగళశీలాయ నమః |
ఓం శతకోటి పరమదేవతాయ నమః |
ఓం శతకోటి పరమమహేశ్వరాయ నమః |
ఓం శతకోటి పరమవిఘ్నవినాశకాయ నమః |
ఓం శతకోటి పరమభూషణభూషితాయ నమః |
ఓం శతకోటి పరమరత్నమాలినే నమః |
ఓం శతకోటి పరమపుణ్యజనసేవ్యాయ నమః |
ఓం శతకోటి పరమసంకటహరాయ నమః |
ఓం శతకోటి పరమసర్వత్రసాక్షిణే నమః |
ఓం శతకోటి పరమానందవల్లభాయ నమః |
ఓం శతకోటి పరమమహాగణపతయే నమః |
ఓం శతకోటి పరమశ్రీగణేశ్వరాయ నమః |
`
        stotra.deity.set(ganesha)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'శ్రీ గణపతి స్తవం'
        stotra.content = `
శుక్లాంబరధరం విష్ణుం శశివర్ణం చతుర్భుజం ।
ప్రసన్నవదనం ధ్యాయేత్ సర్వవిఘ్నోపశాంతయే ॥

వందే వానీ వినాయకౌ ।
స్పష్టార్థ్యోక్తీరయాత్రయే ॥

ఈశానసర్వవిఘ్నానాం ఈశ్వరః పూన్యపూజకః ।
ఏకదంతో మహాకాయో లంబోధరగణాధిపః ॥

విద్యారంభే విశుద్ధార్థే విచక్షణఫలప్రదః ।
గణాధిపః సదా పాయాత్ కృపయా నః వినాయకః ॥

సింధూరవర్ణో విశాలాక్షో విఘ్నరాజో వినాయకః ।
భక్తానుకంపినో నిత్యం బలచంద్రోపశోభితః ॥

ఓంకారస్వరూపశ్చ ఓంకారప్రియదాయకః ।
ఓంకారవచోఽపీఠస్థో నః పాయాద్విఘ్ననాశనః ॥

సకలేశ్వరపూజ్యశ్చ సర్వలోకనమస్కృతః ।
సర్వవిఘ్నహరః శ్రీమానగణాధిపతిరవ్యయః ॥

యః పఠేత్ప్రాతరుత్థాయ గణేశస్యేదమన్తతః ।
తస్య విఘ్నాః ఖలునాశం యాన్తి సకలకర్మసు ॥
`
        stotra.deity.set(ganesha)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'శ్రీ గణేశ కవచం'
        stotra.content = `
అథ శ్రీ గణేశకవచం ॥

ఓం శ్రీగణేశాయ నమః ॥

ఓంకారః పాతు మే శిరః ।
లంబోధరో నయనద్వయం ॥

గజవక్త్రః కర్ణయుగ్మం ।
విఘ్నరాజో నాసికాం పాతు ॥

గజాననో వదనం పాతు ।
గజకేశరీః కంఠదేశం ॥

విఘ్నేశః పాతు హృదయం ।
వినాయకో నాభిదేశం ॥

గణపతిర్జఠరం పాతు ।
గజముఖః పృశ్ఠభాగం ॥

వక్రతుండో బాహుద్వయం ।
ఏకదంష్ట్రః కరద్వయం ॥

హెరంబః పాదయుగ్మం ।
స్కందపూర్వజః సర్వతః పాతు ॥

య ఇదం కవచం నిత్యం ।
ప్రాతః పఠతి మనవః ॥

సర్వవిఘ్నవినాశాయ ।
సర్వసిద్ధిప్రదాయకం ॥

ఇతి శ్రీ గణేశకవచం సమాప్తం ॥
`
        stotra.deity.set(ganesha)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
    stotra.title = 'శ్రీ గణేశ మంగళాశాసనం'
    stotra.content = `
అథ శ్రీ గణేశ మంగళాశాసనం ॥

వక్రతుండాయ హూమ్ న‌మః ।
మోదకప్రియాయ నమః ॥

లంబోదరాయ నమః ।
గజాననాయ నమః ॥

విఘ్నరాజాయ నమః ।
ఏకదంతాయ నమః ॥

గణనాయకాయ నమః ।
హేరంబాయ నమః ॥

గణాధిపాయ నమః ।
గజవక్త్రాయ నమః ॥

సిద్ధి వినాయకాయ నమః ।
సర్వ మంగళ కారణాయ నమః ॥

భక్తాభీష్టప్రదాయ నమః ।
సర్వవిఘ్నవినాశకాయ నమః ॥

మంగళం శ్రీ గణేశాయ ।
మంగళం బలచంద్రాయ ॥

మంగళం విఘ్నరాజాయ ।
మంగళం గజవక్త్రకే ॥

మంగళం గణనాథాయ ।
మంగళం మోదకప్రియాయ ॥

మంగళం సర్వసిద్ధిదాయ ।
మంగళం సర్వమంగళప్రదాయ ॥

ఇతి శ్రీ గణేశ మంగళాశాసనం ॥
`
    stotra.deity.set(ganesha)
    stotra.isFavorite = false
})

await database.get<Stotra>('stotras').create(stotra => {
    stotra.title = 'శ్రీ గణపతి గాయత్రి మంత్రం'
    stotra.content = `
అథ శ్రీ గణపతి గాయత్రి మంత్రం ॥

ఓం ఏకదంతాయ విద్మహే ।
వక్రతుండాయ ధీమహి ।
తన్నో దంతిః ప్రచోదయాత్ ॥

ఓం గజాననాయ విద్మహే ।
వക്രతుండాయ ధీమహి ।
తన్నో దంతిః ప్రచోదయాత్ ॥

ఓం లంబోదరాయ విద్యమహే ।
మహోదరాయ ధీమహి ।
తన్నో దంతిః ప్రచోదయాత్ ॥

ఇతి శ్రీ గణపతి గాయత్రి మంత్రం ॥
`
    stotra.deity.set(ganesha)
    stotra.isFavorite = false
})

await database.get<Stotra>('stotras').create(stotra => {
    stotra.title = 'శ్రీ హేరంభ గణపతి స్తోత్రం'
    stotra.content = `
అథ శ్రీ హేరంభ గణపతి స్తోత్రం ॥

హేరంభం హరసూనుం హరగౌరిసుతం శుభం ।
భక్తాభీష్టప్రదం వందే సర్వవిఘ్నహరంకు వి ॥

పంచాననంఛ త్రినేత్రం లంబోదరసమన్వితం ।
హేరంభం మంగళకరం భజే విఘ్నవినాశనం ॥

సుందరం సుముఖం దీవ్యం సర్వసిద్ధిప్రదాయకం ।
గణనాధం గణపతిం హేరంభం శరణం మమ ॥

భక్తానుగ్రహకర్తారం భక్తపాలనతత్పరం ।
సింహవాహనమిష్టార్థసిద్ధిదం శ్రీసురేశ్వరం ॥

యః పఠేన్నిత్యం మానవో హేరంభస్తుతిముత్తమామ్ ।
తస్య విఘ్నాః ప్రణశ్యంతి సర్వసిద్ధిశ్చ లభ్యతే ॥

ఇతి శ్రీ హేరంభ గణపతి స్తోత్రం ॥
`
    stotra.deity.set(ganesha)
    stotra.isFavorite = false
})

await database.get<Stotra>('stotras').create(stotra => {
    stotra.title = 'శ్రీ విఘ్నేశ్వర అష్టకం'
    stotra.content = `
అథ శ్రీ విఘ్నేశ్వర అష్టకం ॥

వక్రతుండ మహాకాయ సూర్యకోటి సమప్రభ ।
నిర్విఘ్నం కురుమే దేవ సర్వకార్యేషు సర్వదా ॥1॥

శుక్లాంబరధరং విష్ణుం శశివర్ణం చతుర్భుజం ।
ప్రసన్నవదనం ధ్యాయేత్ సర్వవిఘ్నోపశాంతయే ॥2॥

అగజాననపద్మార్కం గజానన మహర్ణిశం ।
అనేకదంతం భక్తానామేకదంతం ఉపాస్మహే ॥3॥

గజాననః పాదయుగం స్మరామి ।
హరప్రియం సుఖదం సురేశం ।
విఘ్నప్రహర్తారం అఖండరూపం ।
భజామి విఘ్నేశ్వరపాదపంకజం ॥4॥

గణాధిపం భూతపతిం వరేషం ।
జగత్ప్రసిద్ధం జగదాధ్యమాయం ।
ప్రసన్నవక్త్రం పరిణతసిద్ధం ।
నమామి నిత్యం గణనాయకేశం ॥5॥

లంబోదరం శక్తిమతం సురేశం ।
కపిల్వర్ణం మరకతప్రకాశం ।
దయానిధిం విశ్వవిఘ్నహర్తారం ।
నమామి దేవం గజవక్త్రరూపమ్ ॥6॥

సిద్ధివినాయకం శాంతిదాతారం ।
మోక్షప్రదాతారం నిత్యమేవ ।
భక్తార్తిహారాయ దేవదేవాయ ।
తుభ్యం నమో విఘ్నవినాశకాయ ॥7॥

ఏతద్విఘ్నేశ్వరాష్టకం యః పఠతి భక్తిసమన్వితః ।
తస్య సర్వాణి కార్యాణి సిద్ధ్యంతే నాత్ర సంశయః ॥8॥

ఇతి శ్రీ విఘ్నేశ్వర అష్టకం ॥
`
    stotra.deity.set(ganesha)
    stotra.isFavorite = false
})

await database.get<Stotra>('stotras').create(stotra => {
    stotra.title = 'శ్రీ గణేశ ప్రహ్లాద కృత స్తోత్రం'
    stotra.content = `
అథ శ్రీ గణేశ ప్రహ్లాద కృత స్తోత్రం ॥

ప్రహ్లాద ఉవాచ ॥

నమస్తే గణప పేథర్విశ్వజ్యేష్ఠాయ ధీమహి ।
గజానన మహోత్సాహ మంగళం మే ప్రదీయతామ్ ॥1॥

సురాసురార్చిత పాదాయ వక్రతుండాయ ధీమహి ।
ఏకదంతాయ శుద్ధాయ ప్రత్యేకం త్వాం నమామ్యహం ॥2॥

ఇంద్రాదివంద్య పాదాబ్జ లంబోదర కృపానిధే ।
విశ్వవిఘ్నవినాశాయ విఘ్నరాజాయ తే నమః ॥3॥

సింధూరవర్ణ శోభాయ శ్రీదాయ చ వరప్రద ।
గణనాధ త్వమేవాధ్యో జగతాం కారణం పరమ్ ॥4॥

భూతపాలసమేతాయ స్కందాగ్రజ వరాయ చ ।
ప్రసన్నవదనాయాఽహం నమో విఘ్నవినాశినే ॥5॥

య ఇదం ప్రహ్లాదకృతం స్తోత్రం నిత్యం భక్త్యా పఠేత్ నరః ।
విఘ్నస్తస్యం న భవతి సర్వత్ర విజయః శివః ॥6॥

ఇతి శ్రీ గణేశ ప్రహ్లాద కృత స్తోత్రం ॥
`
    stotra.deity.set(ganesha)
    stotra.isFavorite = false
})
await database.get<Stotra>('stotras').create(stotra => {
    stotra.title = 'శ్రీ సిద్ధివినాయక స్తోత్రం'
    stotra.content = `
అథ శ్రీ సిద్ధివినాయక స్తోత్రం ॥

ప్రణమ్య శిరసా దేవం గౌరీపుత్రం వినాయకమ్ ।
భక్తావాసం స్మరేఽనిత్యం ఆయుఃకామార్థసిద్ధయే ॥1॥

ప్రథమం వక్రతుండం చ ఏకదంతం ద్వితీయకమ్ ।
తృతీయం కృష్ణపింగాక్షం గజవక్త్రం చ తుర్ణకం ॥2॥

లంబోదరం పంచమం చ షష్ఠం వికటమేవ చ ।
సప్తమం విఘ్నరాజం చ ధూమ్రవర్ణం తథాఽష్టమమ్ ॥3॥

నవమం భాల్‌చంద్రం చ దశమం తు వినాయకమ్ ।
ఏకాదశం గణపతిమ్ ద్వాదశం తు గజాననం ॥4॥

ద్వాదశైతాని నామాని త్రిసంధ్యం యః పఠేన్నరః ।
నచ విఘ్నభయం తస్య సర్వసిద్ధిః కరేఽస్తి హి ॥5॥

విద్యార్థీ లభతే విద్యాం ధనార్థీ లభతే ధనమ్ ।
పుత్రార్థీ లభతే పుత్రాన్ మోక్షార్థీ లభతే గతిమ్ ॥6॥

జపేత్ గణపతిస్తోత్రం షడ్‌భిర్మాసైః ఫలం లభేత్ ।
సం‌వత్సరేణ సిద్ధిః స్యాత్ నసంశయో వినాయకే ॥7॥

ఇతి శ్రీ సిద్ధివినాయక స్తోత్రం ॥
`
    stotra.deity.set(ganesha)
    stotra.isFavorite = false
})


}
