import { Database } from '@nozbe/watermelondb'
import Deity from '../models/Deity'
import Stotra from '../models/Stotra'

export async function seedHanuman(database: Database) {
    const hanuman = await database.get<Deity>('deities').create(deity => {
            deity.name = 'హనుమంతుడు'
            deity.image = 'hanuman'
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'హనుమాన్ చాలీసా'
            stotra.content = `|| దోహా ||
శ్రీ గురు చరన సరోజ రజ నిజమను ముకురు సుధారి |
బరనఉ రఘుబర బిమల జసు జో దాయకు ఫల చారి ||
బుద్ధిహీన తను జానికే సుమిరౌ పవన కుమార |
బల బుద్ధి విద్యా దేహు మోహి హరహు కలేస బికార ||

|| చౌపాఈ ||
జయ హనుమాన జ్ఞాన గున సాగర |
జయ కపీస తిహు లోక ఉజాగర ||

రామదూత అతులిత బలధామా |
అంజని పుత్ర పవనసుత నామా ||

మహాబీర బిక్రమ బజరంగీ |
కుమతి నివార సుమతి కే సంగీ ||

కంచన బరన బిరాజ సుబేసా |
కానన కుండల కుంచిత కేసా ||

హాథ బజ్ర ఔ ధ్వజా బిరాజై |
కాంధే మూంజ జనేఉ సాజై ||

శంకర సువన కేసరీ నందన |
తేజ ప్రతాప మహా జగ బందన ||

విద్యావాన గుణీ అతి చాతుర |
రామ కాజ కరిబే కో ఆతుర ||

ప్రభు చరిత్ర సునిబే కో రసియా |
రామ లఖన సీతా మన బసియా ||`
            stotra.deity.set(hanuman)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'హనుమాన్ అష్టోత్తర శతనామావళి'
            stotra.content = `ఓం హనుమతే నమః |
ఓం అంజనీసుతాయ నమః |
ఓం వాయుపుత్రాయ నమః |
ఓం మహాబలాయ నమః |
ఓం రామేష్టాయ నమః |
ఓం ఫాల్గున సఖాయ నమః |
ఓం పింగాక్షాయ నమః |
ఓం అమితవిక్రమాయ నమః |
ఓం ఉదధికమ్పనాయ నమః |
ఓం సీతాశోక నివారణాయ నమః |
ఓం లక్ష్మణ ప్రాణదాత్రే నమః |
ఓం దశగ్రీవ దర్పహాయ నమః |
ఓం పంచవక్త్రాయ నమః |
ఓం మహాతేజసే నమః |
ఓం రామచూడామణి ప్రదాయ నమః |
ఓం కామరూపిణే నమః |
ఓం పింగళాక్షాయ నమః |
ఓం వర్ధమానాయ నమః |
ఓం బలసిద్ధయే నమః |
ఓం మహాకాయాయ నమః ||

ఇతి శ్రీ హనుమాన్ అష్టోత్తర శతనామావళిః సంపూర్ణమ్ ||`
            stotra.deity.set(hanuman)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'బజరంగ బాణ్'
            stotra.content = `నిశ్చల నిజ మన మాహి సుమిరౌ పవన కుమార |
అపనే వశ కరి లీజై భావ బిషయ బికార ||

జయ హనుమంత సంత హితకారీ |
సుని లీజై ప్రభు అరజ హమారీ ||

జన కే కాజ సఫల కరి దీజో |
జన కే కాజ సఫల కరి దీజో ||

మన క్రమ బచన ధ్యాన జో లావై |
తాహి తుమ్హరో దర్శన పావై ||

మోహి రాఖో సేవక కే నాఈ |
కరో కృపా హే మహారాజ్ ||

తుమ్హరో మన్త్ర విభీషణ మానా |
లంకేశ్వర భయే సబ జగ జానా ||

జస్ కో జప కరై హనుమంత బీర |
తాకే కాజ సఫల హో సబ పీర ||

మాంగో తుమ్హ సే యహీ వరదాన |
రామ చరణ మే రహే హమారో మన ||`
            stotra.deity.set(hanuman)
            stotra.isFavorite = false
        })
}
