import { Database } from '@nozbe/watermelondb'
import Deity from '../models/Deity'
import Stotra from '../models/Stotra'

export async function seedLakshmi(database: Database) {
    const lakshmi = await database.get<Deity>('deities').create(deity => {
            deity.name = 'లక్ష్మీదేవి'
            deity.image = 'lakshmi'
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'మహాలక్ష్మి అష్టకం'
            stotra.content = `నమస్తేస్తు మహామాయే శ్రీపీఠే సురపూజితే |
శంఖచక్ర గదాహస్తే మహాలక్ష్మి నమోస్తుతే ||

నమస్తే గరుడారూఢే కోలాసుర భయంకరి |
సర్వపాప హరే దేవి మహాలక్ష్మి నమోస్తుతే ||

సర్వజ్ఞే సర్వవరదే సర్వదుష్ట భయంకరి |
సర్వదుఃఖ హరే దేవి మహాలక్ష్మి నమోస్తుతే ||

సిద్ధిబుద్ధి ప్రదే దేవి భుక్తిముక్తి ప్రదాయిని |
మంత్రమూర్తే సదా దేవి మహాలక్ష్మి నమోస్తుతే ||

ఆద్యంత రహితే దేవి ఆద్యశక్తి మహేశ్వరి |
యోగజే యోగసంభూతే మహాలక్ష్మి నమోస్తుతే ||

స్థూల సూక్ష్మ మహారౌద్రే మహాశక్తి మహోదరే |
మహాపాప హరే దేవి మహాలక్ష్మి నమోస్తుతే ||

పద్మాసన స్థితే దేవి పరబ్రహ్మ స్వరూపిణి |
పరమేశి జగన్మాతర్ మహాలక్ష్మి నమోస్తుతే ||

శ్వేతాంబర ధరే దేవి నానాలంకార భూషితే |
జగత్స్థితే జగన్మాతర్ మహాలక్ష్మి నమోస్తుతే ||`
            stotra.deity.set(lakshmi)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'లక్ష్మీ స్తోత్రం'
            stotra.content = `నమస్తేస్తు మహామాయే శ్రీపీఠే సురపూజితే |
శంఖచక్ర గదాహస్తే మహాలక్ష్మి నమోస్తుతే ||

యా దేవీ సర్వభూతేషు లక్ష్మీరూపేణ సంస్థితా |
నమస్తస్యై నమస్తస్యై నమస్తస్యై నమో నమః ||

యా దేవీ సర్వభూతేషు శక్తిరూపేణ సంస్థితా |
నమస్తస్యై నమస్తస్యై నమస్తస్యై నమో నమః ||

యా దేవీ సర్వభూతేషు శాంతిరూపేణ సంస్థితా |
నమస్తస్యై నమస్తస్యై నమస్తస్యై నమో నమః ||

సర్వమంగళ మాంగళ్యే శివే సర్వార్థ సాధికే |
శరణ్యే త్ర్యంబకే దేవి నారాయణి నమోస్తుతే ||`
            stotra.deity.set(lakshmi)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'కనకధార స్తోత్రం'
            stotra.content = `అంగం హరేః పులక భూషణ మాశ్రయంతీ
భృంగాంగనేవ ముకులాభరణం తమాలమ్ |
అంగీకృతాఖిల విభూతిరపాంగ లీలా
మాంగళ్య దాస్తు మమ మంగళ దేవతాయాః ||

ముగ్ధా ముహుర్విదధతీ వదనే మురారేః
ప్రేమత్రపా ప్రణిహితాని గతాగతాని |
మాలా ద్రుశోర్మధుకరీవ మహోత్పలే యా
సా మే శ్రియం దిశతు సాగర సంభవాయాః ||

ఆమీలితాక్షమధిగమ్య ముదా ముకుందం
ఆనందకందమనిమేష మనంగతంత్రమ్ |
ఆకేకరస్థిత కనక్ కమలాం తురంగైః
ఆకంపయంతీమివ కంపయతే స మాం కిమ్ ||

భృశం తనోతు భవభీతి హరం తమోఘం
శ్రీవల్లభా కటాక్ష విశేష వీక్షణమ్ |
యేనైవ భార్గవ రామః సరోజనేత్రః
శ్రీమత్స్వభావ మధిగంతుమశేష దృష్టిః ||`
            stotra.deity.set(lakshmi)
            stotra.isFavorite = false
        })
}
