import { Database } from '@nozbe/watermelondb'
import Deity from '../models/Deity'
import Stotra from '../models/Stotra'

export async function seedShiva(database: Database) {
    const shiva = await database.get<Deity>('deities').create(deity => {
            deity.name = 'శివుడు'
            deity.image = 'shiva'
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'శివ తాండవ స్తోత్రం'
            stotra.content = `జటాటవీగలజ్జలప్రవాహపావితస్థలే
గలేవలంబ్య లంబితాం భుజంగతుంగమాలికామ్ |
డమడ్డమడ్డమడ్డమన్నినాదవడ్డమర్వయం
చకార చండతాండవం తనోతు నః శివః శివమ్ ||

జటా కటాహ సంభ్రమ భ్రమన్నిలింప నిర్ఝరీ
విలోల వీచి వల్లరీ విరాజమాన మూర్ధని |
ధగద్ధగద్ధగజ్జ్వలల్లలాట పట్ట పావకే
కిశోర చంద్ర శేఖరే రతిః ప్రతిక్షణం మమ ||

ధరాధరేంద్ర నందినీ విలాస బంధు బంధుర
స్ఫురద్దిగంత సంతతి ప్రమోద మానమానసే |
కృపాకటాక్ష ధోరణీ నిరుద్ధ దుర్ధరాపది
క్వచిద్దిగంబరే మనో వినోదమేతు వస్తుని ||

జటాభుజంగ పింగళ స్ఫురత్ఫణామణి ప్రభా
కదంబ కుంకుమ ద్రవ ప్రలిప్త దిగ్వధూముఖే |
మదాంధ సింధు రస్ఫురత్త్వగుత్తరీయ మేదురే
మనో వినోదమద్భుతం బిభర్తు భూతభర్తరి ||`
            stotra.deity.set(shiva)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'లింగాష్టకం'
            stotra.content = `బ్రహ్మ మురారి సురార్చిత లింగం
నిర్మల భాసిత శోభిత లింగమ్ |
జన్మజ దుఃఖ వినాశక లింగం
తత్ప్రణమామి సదాశివ లింగమ్ ||

దేవమునిప్రవరార్చిత లింగం
కామదహం కరుణాకర లింగమ్ |
రావణ దర్ప వినాశన లింగం
తత్ప్రణమామి సదాశివ లింగమ్ ||

సర్వ సుగంధ సులేపిత లింగం
బుద్ధివివర్ధన కారణ లింగమ్ |
సిద్ధ సురాసుర వందిత లింగం
తత్ప్రణమామి సదాశివ లింగమ్ ||

కనక మహామణి భూషిత లింగం
ఫణిపతి వేష్టిత శోభిత లింగమ్ |
దక్ష సుయజ్ఞ వినాశన లింగం
తత్ప్రణమామి సదాశివ లింగమ్ ||

కుంకుమ చందన లేపిత లింగం
పంకజ హార సుశోభిత లింగమ్ |
సంచిత పాప వినాశన లింగం
తత్ప్రణమామి సదాశివ లింగమ్ ||`
            stotra.deity.set(shiva)
            stotra.isFavorite = false
        })

        await database.get<Stotra>('stotras').create(stotra => {
            stotra.title = 'శివ మంత్ర'
            stotra.content = `ఓం నమః శివాయ |
ఓం నమః శివాయ |
ఓం నమః శివాయ ||

మహామృత్యుంజయ మంత్రం:
ఓం త్ర్యంబకం యజామహే సుగంధిం పుష్టివర్ధనమ్ |
ఉర్వారుకమివ బంధనాన్మృత్యోర్ముక్షీయ మామృతాత్ ||

శివ పంచాక్షర స్తోత్రం:
నాగేంద్రహారాయ త్రిలోచనాయ
భస్మాంగరాగాయ మహేశ్వరాయ |
నిత్యాయ శుద్ధాయ దిగంబరాయ
తస్మై నకారాయ నమః శివాయ ||

మందాకినీ సలిల చందన చర్చితాయ
నందీశ్వర ప్రమథనాథ మహేశ్వరాయ |
మందార ముఖ్య బహుపుష్ప సుపూజితాయ
తస్మై మకారాయ నమః శివాయ ||`
            stotra.deity.set(shiva)
            stotra.isFavorite = false
        })
}
