import { Database } from '@nozbe/watermelondb'
import Deity from '../models/Deity'
import Stotra from '../models/Stotra'

export async function seedVenkateswara(database: Database) {
    const venkateswara = await database.get<Deity>('deities').create(deity => {
        deity.name = 'వెంకటేశ్వర స్వామి'
        deity.image = 'venkateswara'
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'వెంకటేశ్వర సుప్రభాతం'
        stotra.content = `కౌసల్యా సుప్రజా రామ పూర్వా సంధ్యా ప్రవర్తతే |
ఉత్తిష్ఠ నరశార్దూల కర్తవ్యం దైవమాహ్నికమ్ ||

ఉత్తిష్ఠోత్తిష్ఠ గోవింద ఉత్తిష్ఠ గరుడధ్వజ |
ఉత్తిష్ఠ కమలాకాంత త్రైలోక్యం మంగళం కురు ||

మత్తేభ ముఖ మాలోక్య ముక్తా మాణిక్య భూషితమ్ |
వేంకటాచల శైలాభ సుప్రభాతం ప్రయచ్ఛతి ||

శ్రీమన్నాభీష్ట వరదా శ్రీవేంకటనాయక |
శ్రీనివాస జగన్నాథ సుప్రభాతం ప్రయచ్ఛతి ||

కమలా కుచ కుంకుమ రంజిత వక్షః స్థలం |
వారిజ నయన వేంకటేశ సుప్రభాతం ప్రయచ్ఛతి ||`
        stotra.deity.set(venkateswara)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'శ్రీ వేంకటేశ స్తోత్రం'
        stotra.content = `శ్రీమన్నాభీష్ట వరదా శ్రీవేంకటనాయక |
శ్రీనివాస జగన్నాథ దేహి మే పరమాం గతిమ్ ||

శ్రీవేంకటాద్రి శిఖరస్థ దివ్య మంగళ విగ్రహ |
శ్రీనివాస మహాప్రాజ్ఞ దేహి మే పరమాం గతిమ్ ||

శ్రీవేంకటేశ్వర పరబ్రహ్మ శ్రీనివాస జనార్దన |
సర్వ లోక శరణ్య త్వం దేహి మే పరమాం గతిమ్ ||

అలమేలుమంగా సమేత శ్రీనివాస పరబ్రహ్మణే నమః |
వేంకటేశాయ నమః శ్రీనివాసాయ నమః ||`
        stotra.deity.set(venkateswara)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'వేంకటేశ్వర మంగళాశాసనం'
        stotra.content = `మంగళం భగవాన్ విష్ణుః మంగళం గరుడధ్వజః |
మంగళం పుండరీకాక్షః మంగళాయ తనో హరిః ||

మంగళం శ్రీనివాసాయ మంగళం వేంకటేశ్వర |
మంగళం వేంకటాద్రీశ మంగళాయ తనో హరిః ||

మంగళం అలమేలుమంగా సమేత శ్రీనివాసాయ |
మంగళం పద్మావతీ సమేత వేంకటేశ్వరాయ ||

సర్వ మంగళ మాంగళ్యే శివే సర్వార్థ సాధికే |
శరణ్యే త్ర్యంబకే దేవి నారాయణి నమోస్తుతే ||`
        stotra.deity.set(venkateswara)
        stotra.isFavorite = false
    })

    await database.get<Stotra>('stotras').create(stotra => {
        stotra.title = 'విష్ణు సహస్రనామం'
        stotra.content = `|| ధ్యానం ||
శుక్లాంబరధరం విష్ణుం శశివర్ణం చతుర్భుజమ్ |
ప్రసన్నవదనం ధ్యాయేత్ సర్వవిఘ్నోపశాంతయే ||

|| విష్ణు సహస్రనామ స్తోత్రం ||

విశ్వం విష్ణుర్వషట్కారో భూతభవ్యభవత్ప్రభుః |
భూతకృద్భూతభృద్భావో భూతాత్మా భూతభావనః || 1 ||

పూతాత్మా పరమాత్మా చ ముక్తానాం పరమా గతిః |
అవ్యయః పురుషః సాక్షీ క్షేత్రజ్ఞోऽక్షర ఏవ చ || 2 ||

యోగో యోగవిదాం నేతాప్రధాన పురుషేశ్వరః |
నారసింహవపుః శ్రీమాన్ కేశవః పురుషోత్తమః || 3 ||

సర్వః శర్వః శివః స్థాణుర్భూతాదిర్నిధిరవ్యయః |
సంభవో భావనో భర్తా ప్రభవః ప్రభురీశ్వరః || 4 ||

స్వయంభూః శంభురాదిత్యః పుష్కరాక్షో మహాస్వనః |
అనాదినిధనో ధాతా విధాతా ధాతురుత్తమః || 5 ||

అప్రమేయో హృషీకేశః పద్మనాభోऽమరప్రభుః |
విశ్వకర్మా మనుస్త్వష్టా స్థవిష్ఠః స్థవిరో ధ్రువః || 6 ||

అగ్రాహ్యః శాశ్వతః కృష్ణో లోహితాక్షః ప్రతర్దనః |
ప్రభూతస్త్రికకుబ్ధామ పవిత్రం మంగళం పరమ్ || 7 ||

ఈశానః ప్రాణదః ప్రాణో జ్యేష్ఠః శ్రేష్ఠః ప్రజాపతిః |
హిరణ్యగర్భో భూగర్భో మాధవో మధుసూదనః || 8 ||

ఈశ్వరో విక్రమీ ధన్వీ మేధావీ విక్రమః క్రమః |
అనుత్తమో దురాధర్షః కృతజ్ఞః కృతిరాత్మవాన్ || 9 ||

సురేశః శరణం శర్మ విశ్వరేతాఃప్రజాభవః |
అహః సంవత్సరో వ్యాళః ప్రత్యయః సర్వదర్శనః || 10 ||

అజః సర్వేశ్వరః సిద్ధః సిద్ధిః సర్వాదిరచ్యుతః |
వృషాకపిరమేయాత్మా సర్వయోగవినిఃసృతః || 11 ||

వసుర్వసుమనాః సత్యః సమాత్మా సమ్మితః సమః |
అమోఘః పుండరీకాక్షో వృషకర్మా వృషాకృతిః || 12 ||

రుద్రో బహుశిరా బభ్రుః విశ్వయోనిః శుచిశ్రవాః |
అమృతః శాశ్వతః స్థాణుర్వరారోహో మహాతపాః || 13 ||

సర్వగః సర్వవిద్భానుర్విష్వక్సేనో జనార్దనః |
వేదో వేదవిదవ్యంగో వేదాంగో వేదవిత్కవిః || 14 ||

లోకాధ్యక్షః సురాధ్యక్షో ధర్మాధ్యక్షః కృతాకృతః |
చతురాత్మా చతుర్వ్యూహశ్చతుర్దంష్ట్రశ్చతుర్భుజః || 15 ||

భ్రాజిష్ణుర్భోజనం భోక్తా సహిష్ణుర్జగదాదిజః |
అనఘో విజయో జేతా విశ్వయోనిః పునర్వసుః || 16 ||

ఉపేంద్రో వామనః ప్రాంశురమోఘః శుచిరూర్జితః |
అతీంద్రః సంగ్రహః సర్గో ధృతాత్మా నియమో యమః || 17 ||

వేద్యో వైద్యః సదాయోగీ వీరహా మాధవో మధుః |
అతీంద్రియో మహామాయో మహోత్సాహో మహాబలః || 18 ||

మహాబుద్ధిర్మహావీర్యో మహాశక్తిర్మహాద్యుతిః |
అనిర్దేశ్యవపుః శ్రీమానమేయాత్మా మహాద్రిధృక్ || 19 ||

మహేష్వాసో మహీభర్తా శ్రీనివాసః సతాంగతిః |
అనిరుద్ధః సురానందో గోవిందో గోవిదాంపతిః || 20 ||

మరీచిర్దమనో హంసః సుపర్ణో భుజగోత్తమః |
హిరణ్యనాభః సుతపాః పద్మనాభః ప్రజాపతిః || 21 ||

అమృత్యుః సర్వదృక్సింహః సంధాతా సంధిమాన్స్థిరః |
అజో దుర్మర్షణః శాస్తా విశ్రుతాత్మా సురారిహా || 22 ||

గురుర్గురుతమో ధామ సత్యః సత్యపరాక్రమః |
నిమిషోऽనిమిషః స్రగ్వీ వాచస్పతిరుదారధీః || 23 ||

అగ్రణీర్గ్రామణీః శ్రీమాన్న్యాయో నేతా సమీరణః |
సహస్రమూర్ధా విశ్వాత్మా సహస్రాక్షః సహస్రపాత్ || 24 ||

ఆవర్తనో నివృత్తాత్మా సంవృతః సంప్రమర్దనః |
అహః సంవర్తకో వహ్నిరనిలో ధరణీధరః || 25 ||

సుప్రసాదఃప్రసన్నాత్మా విశ్వధృగ్విశ్వభుగ్విభుః |
సత్కర్తా సత్కృతః సాధుర్జహ్నుర్నారాయణో నరః || 26 ||

అసంఖ్యేయోऽప్రమేయాత్మా విశిష్టః శిష్టకృచ్ఛుచిః |
సిద్ధార్థః సిద్ధసంకల్పః సిద్ధిదః సిద్ధిసాధనః || 27 ||

వృషాహీ వృషభో విష్ణుర్వృషపర్వా వృషోదరః |
వర్ధనో వర్ధమానశ్చ వివిక్తః శ్రుతిసాగరః || 28 ||

సుభుజో దుర్ధరో వాగ్మీ మహేంద్రో వసుదో వసుః |
నైకరూపో బృహద్రూపః శిపివిష్టః ప్రకాశనః || 29 ||

ఓజస్తేజోద్యుతిధరః ప్రకాశాత్మా ప్రతాపనః |
ఋద్ధః స్పష్టాక్షరో మంత్రశ్చంద్రాంశుర్భాస్కరద్యుతిః || 30 ||

అమృతాంశూద్భవో భానుః శశబిందుః సురేశ్వరః |
ఔషధం జగతః సేతుః సత్యధర్మపరాక్రమః || 31 ||

భూతభవ్యభవన్నాథః పవనః పావనోऽనలః |
కామహా కామకృత్కాంతః కామః కామప్రదః ప్రభుః || 32 ||

యుగాదికృద్యుగావర్తో నైకమాయో మహాశనః |
అదృశ్యో వ్యక్తరూపశ్చ సహస్రజిదనంతజిత్ || 33 ||

ఇష్టోऽవిశిష్టః శిష్టేష్టః శిఖండీ నహుషో వృషః |
క్రోధహా క్రోధకృత్కర్తా విశ్వబాహుర్మహీధరః || 34 ||

అచ్యుతః ప్రథితః ప్రాణః ప్రాణదో వాసవానుజః |
అపాంనిధిరధిష్ఠానమప్రమత్తఃప్రతిష్ఠితః || 35 ||

స్కందః స్కందధరో ధుర్యో వరదో వాయువాహనః |
వాసుదేవో బృహద్భానురాదిదేవః పురందరః || 36 ||

అశోకస్తారణస్తారః శూరః శౌరిర్జనేశ్వరః |
అనుకూలః శతావర్తః పద్మీ పద్మనిభేక్షణః || 37 ||

పద్మనాభోऽరవిందాక్షః పద్మగర్భః శరీరభృత్ |
మహర్ధిరృద్ధో వృద్ధాత్మా మహాక్షో గరుడధ్వజః || 38 ||

అతులః శరభో భీమః సమయజ్ఞో హవిర్హరిః |
సర్వలక్షణలక్షణ్యో లక్ష్మీవాన్సమితింజయః || 39 ||

విక్షరో రోహితో మార్గో హేతుర్దామోదరః సహః |
మహీధరో మహాభాగో వేగవానమితాశనః || 40 ||

ఉద్భవః క్షోభణో దేవః శ్రీగర్భః పరమేశ్వరః |
కరణం కారణం కర్తా విక్రతా గహనో గుహః || 41 ||

వ్యవసాయో వ్యవస్థానః సంస్థానః స్థానదో ధ్రువః |
పరర్ధిః పరమస్పష్టస్తుష్టః పుష్టః శుభేక్షణః || 42 ||

రామో విరామో విరజో మార్గో నేయో నయోऽనయః |
వీరః శక్తిమతాం శ్రేష్ఠో ధర్మో ధర్మవిదుత్తమః || 43 ||

వైకుంఠః పురుషః ప్రాణః ప్రాణదః ప్రణవః పృథుః |
హిరణ్యగర్భః శత్రుఘ్నో వ్యాప్తో వాయురధోక్షజః || 44 ||

ఋతుః సుదర్శనః కాలః పరమేష్ఠీ పరిగ్రహః |
ఉగ్రః సంవత్సరో దక్షో విశ్రామో విశ్వదక్షిణః || 45 ||

విస్తారః స్థావరస్థాణుః ప్రమాణం బీజమవ్యయమ్ |
అర్థోऽనర్థో మహాకోశో మహాభోగో మహాధనః || 46 ||

అనిర్విణ్ణః స్థవిష్ఠో భూర్ధర్మయూపో మహామఖః |
నక్షత్రనేమిర్నక్షత్రీ క్షమః క్షామః సమీహనః || 47 ||

యజ్ఞ ఇజ్యో మహేజ్యశ్చ క్రతుః సత్రం సతాంగతిః |
సర్వదర్శీ విముక్తాత్మా సర్వజ్ఞో జ్ఞానముత్తమమ్ || 48 ||

సువ్రతః సుముఖః సూక్ష్మః సుఘోషః సుఖదః సుహృత్ |
మనోహరో జితక్రోధో వీరబాహుర్విదారణః || 49 ||

స్వాపనః స్వవశో వ్యాపీ నైకాత్మా నైకకర్మకృత్ |
వత్సరో వత్సలో వత్సీ రత్నగర్భో ధనేశ్వరః || 50 ||

ధర్మగుబ్ధర్మకృద్ధర్మీ సదసత్క్షరమక్షరమ్ |
అవిజ్ఞాతా సహస్రాంశుర్విధాతా కృతలక్షణః || 51 ||

గభస్తినేమిః సత్త్వస్థః సింహో భూతమహేశ్వరః |
ఆదిదేవో మహాదేవో దేవేశో దేవభృద్గురుః || 52 ||

ఉత్తరో గోపతిర్గోప్తా జ్ఞానగమ్యః పురాతనః |
శరీరభూతభృద్భోక్తా కపీంద్రో భూరిదక్షిణః || 53 ||

సోమపోऽమృతపః సోమః పురుజిత్పురుసత్తమః |
వినయో జయః సత్యసంధో దాశార్హః సాత్వతాంపతిః || 54 ||

జీవో వినయితాసాక్షీ ముకుందోऽమితవిక్రమః |
అంభోనిధిరనంతాత్మా మహోదధిశయోऽంతకః || 55 ||

అజో మహార్హః స్వాభావ్యో జితామిత్రః ప్రమోదనః |
ఆనందో నందనో నందః సత్యధర్మా త్రివిక్రమః || 56 ||

మహర్షిః కపిలాచార్యః కృతజ్ఞో మేదినీపతిః |
త్రిపదస్త్రిదశాధ్యక్షో మహాశృంగః కృతాంతకృత్ || 57 ||

మహావరాహో గోవిందః సుషేణః కనకాంగదీ |
గుహ్యో గభీరో గహనో గుప్తశ్చక్రగదాధరః || 58 ||

వేధాః స్వాంగోऽజితః కృష్ణో దృఢః సంకర్షణోऽచ్యుతః |
వరుణో వారుణో వృక్షః పుష్కరాక్షో మహామనాః || 59 ||

భగవాన్భగహాऽనందీ వనమాలీ హలాయుధః |
ఆదిత్యో జ్యోతిరాదిత్యః సహిష్ణుర్గతిసత్తమః || 60 ||

సుధన్వా ఖండపరశుర్దారుణో ద్రవిణప్రదః |
దివస్పృక్సర్వదృగ్వ్యాసో వాచస్పతిరయోనిజః || 61 ||

త్రిసామా సామగః సామ నిర్వాణం భేషజం భిషక్ |
సన్యాసకృచ్ఛమః శాంతో నిష్ఠా శాంతిః పరాయణమ్ || 62 ||

శుభాంగః శాంతిదః స్రష్టా కుముదః కువలేశయః |
గోహితో గోపతిర్గోప్తా వృషభాక్షో వృషప్రియః || 63 ||

అనివర్తీ నివృత్తాత్మా సంక్షేప్తా క్షేమకృచ్ఛివః |
శ్రీవత్సవక్షాః శ్రీవాసః శ్రీపతిః శ్రీమతాంవరః || 64 ||

శ్రీదః శ్రీశః శ్రీనివాసః శ్రీనిధిః శ్రీవిభావనః |
శ్రీధరః శ్రీకరః శ్రేయః శ్రీమాన్లోకత్రయాశ్రయః || 65 ||

స్వక్షః స్వంగః శతానందో నందిర్జ్యోతిర్గణేశ్వరః |
విజితాత్మా విధేయాత్మా సత్కీర్తిశ్ఛిన్నసంశయః || 66 ||

ఉదీర్ణః సర్వతశ్చక్షురనీశః శాశ్వతస్థిరః |
భూశయో భూషణో భూతిర్విశోకః శోకనాశనః || 67 ||

అర్చిష్మానర్చితః కుంభో విశుద్ధాత్మా విశోధనః |
అనిరుద్ధోऽప్రతిరథః ప్రద్యుమ్నోऽమితవిక్రమః || 68 ||

కాలనేమినిహా వీరః శౌరిః శూరజనేశ్వరః |
త్రిలోకాత్మా త్రిలోకేశః కేశవః కేశిహా హరిః || 69 ||

కామదేవః కామపాలః కామీ కాంతః కృతాగమః |
అనిర్దేశ్యవపుర్విష్ణుర్వీరోऽనంతో ధనంజయః || 70 ||

బ్రహ్మణ్యో బ్రహ్మకృద్బ్రహ్మా బ్రహ్మ బ్రహ్మవివర్ధనః |
బ్రహ్మవిద్బ్రాహ్మణో బ్రహ్మీ బ్రహ్మజ్ఞో బ్రాహ్మణప్రియః || 71 ||

మహాక్రమో మహాకర్మా మహాతేజా మహోరగః |
మహాక్రతుర్మహాయజ్వా మహాయజ్ఞో మహాహవిః || 72 ||

స్తవ్యః స్తవప్రియః స్తోత్రం స్తుతిః స్తోతా రణప్రియః |
పూర్ణః పూరయితా పుణ్యః పుణ్యకీర్తిరనామయః || 73 ||

మనోజవస్తీర్థకరో వసురేతా వసుప్రదః |
వసుప్రదో వాసుదేవో వసుర్వసుమనా హవిః || 74 ||

సద్గతిః సత్కృతిః సత్తా సద్భూతిః సత్పరాయణః |
శూరసేనో యదుశ్రేష్ఠః సన్నివాసః సుయామునః || 75 ||

భూతావాసో వాసుదేవః సర్వాసునిలయోऽనలః |
దర్పహా దర్పదో దృప్తో దుర్ధరోऽథాపరాజితః || 76 ||

విశ్వమూర్తిర్మహామూర్తిర్దీప్తమూర్తిరమూర్తిమాన్ |
అనేకమూర్తిరవ్యక్తః శతమూర్తిః శతాననః || 77 ||

ఏకో నైకః సవః కః కిం యత్తత్పదమనుత్తమమ్ |
లోకబంధుర్లోకనాథో మాధవో భక్తవత్సలః || 78 ||

సువర్ణవర్ణో హేమాంగో వరాంగశ్చందనాంగదీ |
వీరహా విషమః శూన్యో ఘృతాశీరచలశ్చలః || 79 ||

అమానీ మానదో మాన్యో లోకస్వామీ త్రిలోకధృక్ |
సుమేధా మేధజో ధన్యః సత్యమేధా ధరాధరః || 80 ||

తేజోవృషో ద్యుతిధరః సర్వశస్త్రభృతాంవరః |
ప్రగ్రహో నిగ్రహో వ్యగ్రో నైకశృంగో గదాగ్రజః || 81 ||

చతుర్మూర్తిశ్చతుర్బాహుశ్చతుర్వ్యూహశ్చతుర్గతిః |
చతురాత్మా చతుర్భావశ్చతుర్వేదవిదేకపాత్ || 82 ||

సమావర్తోऽనివృత్తాత్మా దుర్జయో దురతిక్రమః |
దుర్లభో దుర్గమో దుర్గో దురావాసో దురారిహా || 83 ||

శుభాంగో లోకసారంగః సుతంతుస్తంతువర్ధనః |
ఇంద్రకర్మా మహాకర్మా కృతకర్మా కృతాగమః || 84 ||

ఉద్భవః సుందరః సుందో రత్ననాభః సులోచనః |
అర్కో వాజసనః శృంగీ జయంతః సర్వవిజ్జయీ || 85 ||

సువర్ణబిందురక్షోభ్యః సర్వవాగీశ్వరేశ్వరః |
మహాహ్రదో మహాగర్తో మహాభూతో మహానిధిః || 86 ||

కుముదః కుందరః కుందః పర్జన్యః పావనోऽనిలః |
అమృతాశోऽమృతవపుః సర్వజ్ఞః సర్వతోముఖః || 87 ||

సులభః సువ్రతః సిద్ధః శత్రుజిచ్ఛత్రుతాపనః |
న్యగ్రోధోదుంబరోऽశ్వత్థశ్చాణూరాంధ్రనిషూదనః || 88 ||

సహస్రార్చిః సప్తజిహ్వః సప్తైధాః సప్తవాహనః |
అమూర్తిరనఘోऽచింత్యో భయకృద్భయనాశనః || 89 ||

అణుర్బృహత్కృశః స్థూలో గుణభృన్నిర్గుణో మహాన్ |
అధృతః స్వధృతః స్వాస్యః ప్రాగ్వంశో వంశవర్ధనః || 90 ||

భారభృత్కథితో యోగీ యోగీశః సర్వకామదః |
ఆశ్రమః శ్రమణః క్షామః సుపర్ణో వాయువాహనః || 91 ||

ధనుర్ధరో ధనుర్వేదో దండో దమయితా దమః |
అపరాజితః సర్వసహో నియంతాऽనియమోऽయమః || 92 ||

సత్త్వవాన్సాత్త్వికః సత్యః సత్యధర్మపరాయణః |
అభిప్రాయః ప్రియార్హోऽర్హః ప్రియకృత్ప్రీతివర్ధనః || 93 ||

విహాయసగతిర్జ్యోతిః సురుచిర్హుతభుగ్విభుః |
రవిర్విరోచనః సూర్యః సవితా రవిలోచనః || 94 ||

అనంతో హుతభుగ్భోక్తా సుఖదో నైకజోऽగ్రజః |
అనిర్విణ్ణః సదామర్షీ లోకాధిష్ఠానమద్భుతః || 95 ||

సనాత్సనాతనతమః కపిలః కపిరవ్యయః |
స్వస్తిదః స్వస్తికృత్స్వస్తి స్వస్తిభుక్స్వస్తిదక్షిణః || 96 ||

అరౌద్రః కుండలీ చక్రీ విక్రమ్యూర్జితశాసనః |
శబ్దాతిగః శబ్దసహః శిశిరః శర్వరీకరః || 97 ||

అక్రూరః పేశలో దక్షో దక్షిణః క్షమిణాంవరః |
విద్వత్తమో వీతభయః పుణ్యశ్రవణకీర్తనః || 98 ||

ఉత్తారణో దుష్కృతిహా పుణ్యో దుఃస్వప్ననాశనః |
వీరహా రక్షణః సంతో జీవనః పర్యవస్థితః || 99 ||

అనంతరూపోऽనంతశ్రీర్జితమన్యుర్భయాపహః |
చతురశ్రో గభీరాత్మా విదిశో వ్యాదిశో దిశః || 100 ||

అనాదిర్భూర్భువో లక్ష్మీః సువీరో రుచిరాంగదః |
జననో జనజన్మాదిర్భీమో భీమపరాక్రమః || 101 ||

ఆధారనిలయోऽధాతా పుష్పహాసః ప్రజాగరః |
ఊర్ధ్వగః సత్పథాచారః ప్రాణదః ప్రణవః పణః || 102 ||

ప్రమాణం ప్రాణనిలయః ప్రాణభృత్ప్రాణజీవనః |
తత్త్వం తత్త్వవిదేకాత్మా జన్మమృత్యుజరాతిగః || 103 ||

భూర్భువః స్వస్తరుస్తారః సవితా ప్రపితామహః |
యజ్ఞో యజ్ఞపతిర్యజ్వా యజ్ఞాంగో యజ్ఞవాహనః || 104 ||

యజ్ఞభృద్యజ్ఞకృద్యజ్ఞీ యజ్ఞభుగ్యజ్ఞసాధనః |
యజ్ఞాంతకృద్యజ్ఞగుహ్యమన్నమన్నాద ఏవ చ || 105 ||

ఆత్మయోనిః స్వయంజాతో వైఖానః సామగాయనః |
దేవకీనందనః స్రష్టా క్షితీశః పాపనాశనః || 106 ||

శంఖభృన్నందకీ చక్రీ శార్ంగధన్వా గదాధరః |
రథాంగపాణిరక్షోభ్యః సర్వప్రహరణాయుధః || 107 ||

వనమాలీ గదీ శార్ంగీ శంఖీ చక్రీ చ నందకీ |
శ్రీమాన్నారాయణో విష్ణుర్వృషాకపిర్జనార్దనః || 108 ||

|| ఫలశ్రుతి ||

వాసుదేవాశ్రయో వృద్ధః శ్రుతః కవిరవ్యయః |
శ్రుతిసాగరోऽమోఘః పుండరీకవిలోచనః ||

ఇతి శ్రీ విష్ణు సహస్రనామ స్తోత్రం సంపూర్ణమ్ ||

|| హరిః ఓం తత్సత్ ||`
        stotra.deity.set(venkateswara)
        stotra.isFavorite = false
    })
}
